; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation13 - direction
	GroundStation12 - direction
	Star9 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star14 - direction
	Star5 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation8 - direction
	Star6 - direction
	Star7 - direction
	GroundStation3 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation12)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation10)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 Star6)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star11)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star14)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star11)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite3 Star7)
	(pointing satellite4 Star14)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Star17 image1)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
))

)

; plan
1. (turn_to satellite3 star7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star7)
   goals met: 1 of 7
2. (turn_to satellite2 groundstation0 groundstation10)
   deleted: (pointing satellite2 groundstation10)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 7
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 7
4. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 7
5. (turn_to satellite2 star17 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star17)
   goals met: 1 of 7
6. (take_image satellite2 star17 instrument3 image1)
   added: (have_image star17 image1)
   goals met: 2 of 7
7. (turn_to satellite2 phenomenon16 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation0 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 7
9. (take_image satellite2 phenomenon16 instrument3 image2)
   added: (have_image phenomenon16 image2)
   goals met: 3 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon15 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 7
14. (turn_to satellite0 star18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star18)
   goals met: 4 of 7
15. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 5 of 7
16. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 5 of 7
17. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 6 of 7
18. (turn_to satellite4 star14 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star14)
   goals met: 7 of 7
